Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=1.2/constant/PaxHeaders.21019/turbulenceProperties
30 mtime=1559334475.113312857
30 atime=1566337516.817761517
30 ctime=1565968659.745945481
