Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=1.2/0/PaxHeaders.21019/nut
29 atime=1566337514.29775165
30 ctime=1565968659.745945481
