Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=1.2/system/PaxHeaders.21019/residuals
30 mtime=1559334471.609306032
30 atime=1566337514.329751776
29 ctime=1565968659.89394572
