Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=1.2/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    active     yes;
    type       limitTemperature;
    min        100;	//101
    max        900;	//900-1000 with 800 beocmes unbounded
    selectionMode all;
}

//************************************************************************** //
